## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [440]:
import pandas as pd
import numpy as np
import sqlite3
import json
import pickle

# Initial data investigation

In [5]:
cd zippedData

[Errno 2] No such file or directory: 'zippedData'
/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/zippedData

In [6]:
ls

bom.movie_gross.csv.gz        imdb.title.principals.csv.gz
column_summary.csv            imdb.title.ratings.csv.gz
imdb.name.basics.csv.gz       rt.movie_info.tsv.gz
imdb.title.akas.csv.gz        rt.reviews.tsv.gz
imdb.title.basics.csv.gz      tmdb.movies.csv.gz
imdb.title.crew.csv.gz        tn.movie_budgets.csv.gz

In [7]:
def preview_csvtsv(filepath, row_count):
    """Create a dataframe of initial n rows from file as a preview.
    Supports either csv or tsv file formats, and files compressed as gz.
    File format and gz detected using file extensions.
    Prints a preview dataframe of the file, the preview's head(), 
    and the total number of rows.
    """
    import gzip
    is_gz = False
    
    print(f"""--------------------------------------------------
    File: {filepath}
    --------------------------------------------------""")
    
    # determine file extension(s)
    if filepath.split('.')[-1].lower() == 'csv':
        filetype='csv'
    elif filepath.split('.')[-1].lower() == 'tsv':
        filetype='tsv'
    elif filepath.split('.')[-1].lower() == 'gz':
        # if we have a gz file, get second to last element
        is_gz = True
        if filepath.split('.')[-2].lower() == 'csv':
            filetype='csv'
        elif filepath.split('.')[-2].lower() == 'tsv':
            filetype='tsv'
    else:
        # default to CSV if can't determine the file extention
        filetype='csv'
    
    # Process file based on extension. 
    # Pandas doesn't care if the file is a gz compressed
    if filetype == 'csv':
        df_test = pd.read_csv(filepath, nrows=row_count)
    elif filetype == 'tsv':
        df_test = pd.read_table(filepath, nrows=row_count)

    num_lines = 0
    
    # get line count. This differs based on if the file is gz or not
    if is_gz:
        for line in gzip.open(filepath):
            num_lines += 1
    else:
        for line in open(filepath):
            num_lines += 1
    
    display(df_test.head())
    display(df_test.info())
    print(f"\nFile contains {num_lines} total lines, including header.")
    print('\n\n\n')
    
    pass

In [8]:
def filelist_to_dfs_prelim(filepath_list, dfname_list):
    """Creates a dataframe for each file in the list.
    Names each dataframe using the corresponding name list.
    """
    df_dict = {}
    filetype = ''

    if len(filepath_list) != len(dfname_list):
        return "Error: lists must be of equivalent length."
    
    # loop through each file in the filepath_list
    for i, file in enumerate(filepath_list):
        
        print(f"Working on {file}...")
        
        # figure out the file type to use the appropriate method
        if file.split('.')[-1].lower() == 'csv':
            filetype='csv'
        elif file.split('.')[-1].lower() == 'tsv':
            filetype='tsv'
        elif file.split('.')[-2].lower() == 'csv':
            filetype='csv'
        elif file.split('.')[-2].lower() == 'tsv':
            filetype='tsv'
        else:
            # default to CSV if can't determine the file extention
            filetype='csv'
        
        try:
            # determine file extension and apply appropriate method to load preview
            if filetype == 'tsv':
                df_dict[dfname_list[i]] = pd.read_table(file)
            else:
                # default to CSV if not tsv
                df_dict[dfname_list[i]] = pd.read_csv(file) 
        except:
            print(f"Error encountered and {file} was skipped")

    return df_dict

In [9]:
def filelist_to_dfs_errorh(filepath_list, dfname_list):
    """Creates a dataframe for each file in the list.
    Names each dataframe using the corresponding name list.
    """
    df_dict = {}
    filetype = ''
    
    if len(filepath_list) != len(dfname_list):
        return "Error: lists must be of equivalent length."
    
    # loop through each file in the filepath_list
    for i, file in enumerate(filepath_list):
        
        print(f"Working on {file}...")

        # figure out the file type to use the appropriate method
        if file.split('.')[-1].lower() == 'csv':
            filetype='csv'
        elif file.split('.')[-1].lower() == 'tsv':
            filetype='tsv'
        elif file.split('.')[-2].lower() == 'csv':
            filetype='csv'
        elif file.split('.')[-2].lower() == 'tsv':
            filetype='tsv'
        else:
            # default to CSV if can't determine the file extention
            filetype='csv'
        
        # determine file extension and apply appropriate method to load df
        # Credit to https://stackoverflow.com/questions/33440805
        #     /pandas-dataframe-read-csv-on-bad-data for handling error rows
        if filetype == 'tsv':
            df_dict[dfname_list[i]] = pd.read_table(file
                                        , error_bad_lines = False
                                        , warn_bad_lines = True
                                        , encoding='latin1') 
        else:
            # default to CSV if not tsv
            df_dict[dfname_list[i]] = pd.read_csv(file
                                        , error_bad_lines = False
                                        , warn_bad_lines = True
                                        , encoding='latin1') 

    return df_dict

In [10]:
def summarize_cols(df_dict):
    """Creates a dataframe with df/column summary info.
    Takes a dictionary as input, where the key is the name of the df,
    and the value is the dataframe itself."""
    
    arr_colsumm = np.array([['df_namekey', 'col_name'
                                 , 'col_type', 'col_nan_count'
                                 , 'total_rows']])
    
    for df_key in df_dict.keys():
        # append each column's info to the array
        for col in df_dict[df_key].columns:
            arr_colsumm = np.append(arr_colsumm
               , [[df_key
                 , col
                 , df_dict[df_key][col].dtype
                 , df_dict[df_key][col].isna().sum()
                 , len(df_dict[df_key])]], axis=0)

    df_colsumm = pd.DataFrame(arr_colsumm[1:], columns=arr_colsumm[0])
    
    return df_colsumm

In [11]:
files = ['bom.movie_gross.csv.gz'
         ,'imdb.title.ratings.csv.gz'
         ,'imdb.name.basics.csv.gz'
         ,'rt.movie_info.tsv.gz'
         ,'imdb.title.akas.csv.gz'
         ,'rt.reviews.tsv.gz'
         ,'imdb.title.basics.csv.gz'
         ,'tmdb.movies.csv.gz'
         ,'imdb.title.crew.csv.gz'
         ,'tn.movie_budgets.csv.gz'
         ,'imdb.title.principals.csv.gz']

df_names = ['df_bom_gross'
         ,'df_imdb_ratings'
         ,'df_imdb_namebasics'
         ,'df_rt_movie_info'
         ,'df_imdb_akas'
         ,'df_rt_reviews'
         ,'df_imdb_basics'
         ,'df_tmdb_movies'
         ,'df_imdb_crew'
         ,'df_tn_budgets'
         ,'df_imdb_principals']

### Initial preview of first 10 rows of each file

First, I loaded only the first 10 rows of each file into a dataframe and displayed the `head()`. This function also counts the total lines in each file.

I reviewed the results from each file to understand what information they contain. In terms of what I'm hoping for, I'm not sure whether I have sufficient data to calculate the actual profit. Ideally, I would like the profit calculation to be something like:

sum(box office gross, streaming revenue, VOD revenue, merchandising revenue)

minus


sum(production actual costs, advertising spend, theaters' cut)

In [12]:
#[preview_csvtsv(file, 10) for file in files]

### Import files into data frames and summarize columns

Next, I ran a function that attempts to actually import the full files into data frames. It returns a dictionary with the keys being the df names I specified, and the values being the dataframes themselves.

One of the 'tsv' files from Rotten Tomatoes encountered errors while importing, although there were no errors with the initial 10-row preview. I was able to run through another function that has more error handling, and adjust the encoding to get a good import.

Finally, I ran the dictionary of dataframes through a function which summarizes the columns. I think this will help me see which columns I have.

In [13]:
df_dict = filelist_to_dfs_prelim(files, df_names)
df_dict.keys()

Working on bom.movie_gross.csv.gz...
Working on imdb.title.ratings.csv.gz...
Working on imdb.name.basics.csv.gz...
Working on rt.movie_info.tsv.gz...
Working on imdb.title.akas.csv.gz...
Working on rt.reviews.tsv.gz...
Error encountered and rt.reviews.tsv.gz was skipped
Working on imdb.title.basics.csv.gz...
Working on tmdb.movies.csv.gz...
Working on imdb.title.crew.csv.gz...
Working on tn.movie_budgets.csv.gz...
Working on imdb.title.principals.csv.gz...

dict_keys(['df_bom_gross', 'df_imdb_ratings', 'df_imdb_namebasics', 'df_rt_movie_info', 'df_imdb_akas', 'df_imdb_basics', 'df_tmdb_movies', 'df_imdb_crew', 'df_tn_budgets', 'df_imdb_principals'])

In [14]:
df_dict2 = filelist_to_dfs_errorh(['rt.reviews.tsv.gz'], ['df_rt_reviews'])
df_dict2.keys()

Working on rt.reviews.tsv.gz...

dict_keys(['df_rt_reviews'])

In [15]:
df_dict2['df_rt_reviews']

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [16]:
# Merge dict of clean dfs with the dict of dfs that had errors
df_dict.update(df_dict2)
df_dict.keys()

dict_keys(['df_bom_gross', 'df_imdb_ratings', 'df_imdb_namebasics', 'df_rt_movie_info', 'df_imdb_akas', 'df_imdb_basics', 'df_tmdb_movies', 'df_imdb_crew', 'df_tn_budgets', 'df_imdb_principals', 'df_rt_reviews'])

### Create a summary of the columns in each table

Export this summary to a CSV file so I can make outside notes.

In [17]:
df_colsumm = summarize_cols(df_dict)
#df_colsumm.to_csv('column_summary.csv',index=False)

# SQL Ingestion for deeper analysis

I will create a SQLlite database and import the files I intend to use in my analysis into tables. I think this will be the best way to clean the data and save my changes outside of the Jupyter Notebook without a lot of file import/export.

I will be making notes for what I want to transform, date ranges, etc for each table and column outside of this notebook, and then will find a good way to get the information back in. This mostly saves me from scrolling up and down and makes it easier to take notes without worrying about formatting.

## Create New SQLLite database

In [442]:
cd ..

/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project

In [449]:
cd "/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/analysis"

/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/analysis

In [390]:
ls

movie_analysis.db   movie_analysis2.db

In [450]:
# Create new database (or conenct to it, later)
conn = sqlite3.connect('movie_analysis2.db')
cur = conn.cursor()

## Wait is this data any good??

In [30]:
# Starting with the The Numbers data set, as profit is first analysis
# I want to tackle

# Get the column info
df_dict['df_tn_budgets'].head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

Trying to determine whether the budget will always be in US dollars, whether it is adjusted for inflation, et. Trying to confirm whether domestic gross and worldwide gross include more than box office?

Interstingly, when I look up Avatar on The Numbers, the figures don't match what I see here.
https://www.the-numbers.com/movie/Avatar#tab=summary

Gross numbers more or less match what I see under box office, so I think those are box office only.

But production budget is only 237 compared to $425 MM that I see in my table.

I tried their movie comparison tool which lets you compare movies and adjust for inflation, and I'm not sure where the $425 MM is coming from, It's not just inflation. With inflation adjustment Avatar's budget is still only 289 million. https://www.the-numbers.com/movies/custom-comparisons/Avatar/Titanic-(1997)?mode=actuals#tab=day_by_day_comparison

Looking deeper at source which have APIs, The Movie Database has a free API with NO rate limiting.

I spot checked Avatar and Titanic across The Numbers and the revenue and budget are roughly equivalent (The Numbers had slightly higher revenue so may be more up to date than TMDb but pretty close.

Going to try getting the data from TMDB. Bonus is that my Watchmode data has TMDB ID, so I can easily join them.

## Looking through the rest of the data sets

### TMDB Movies

I think I'm going to get much more than this includes (definitely more fields) but curious what date ranges, etc we have.

In [27]:
df_dict['df_tmdb_movies'].head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [28]:
df_dict['df_tmdb_movies'].describe()

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

OK so this does go down to popularity = 0.6. Mean is 3.13, hmm.

Minimum vote_count is 1 though, so maybe it's all movies with at least one vote.

In [40]:
df_dict['df_tmdb_movies']['year'] = df_dict['df_tmdb_movies']['release_date'].map(lambda date: int(date[:4]))

In [38]:
df_dict['df_tmdb_movies']['year']

0        2010
1        2010
2        2010
3        1995
4        2010
         ...
26512    2018
26513    2018
26514    2018
26515    2018
26516    2018
Name: year, Length: 26517, dtype: object

In [41]:
df_dict['df_tmdb_movies'].describe()

,Unnamed: 0,id,popularity,vote_average,vote_count,year
count,26517.00000,26517.000000,26517.000000,26517.000000,26517.000000,26517.000000
mean,13258.00000,295050.153260,3.130912,5.991281,194.224837,2013.953162
std,7654.94288,153661.615648,4.355229,1.852946,960.961095,3.544641
min,0.00000,27.000000,0.600000,0.000000,1.000000,1930.000000
25%,6629.00000,157851.000000,0.600000,5.000000,2.000000,2012.000000
50%,13258.00000,309581.000000,1.374000,6.000000,5.000000,2014.000000
75%,19887.00000,419542.000000,3.694000,7.000000,28.000000,2016.000000
max,26516.00000,608444.000000,80.773000,10.000000,22186.000000,2020.000000

### Rotten Tomatoes Tables

Well this would have been nice to have, but there aren't titles listed and no other data set matches its ids.

In [43]:
df_dict['df_rt_movie_info'].head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [44]:
df_dict['df_rt_reviews'].head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

### IMDB Datasets - Basics

In [452]:
df_dict['df_imdb_basics'].head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [453]:
df_dict['df_imdb_basics'].describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [454]:
# Try importing entire dataframe into SQLLite
df_dict['df_imdb_basics'].to_sql('imdb_basics', conn,index=False)

In [455]:
conn.commit()

In [456]:
sql = """SELECT * FROM imdb_basics LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           5 non-null      object
 1   primary_title    5 non-null      object
 2   original_title   5 non-null      object
 3   start_year       5 non-null      int64
 4   runtime_minutes  4 non-null      float64
 5   genres           5 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

### IMDB Datasets - Crew

In [457]:
df_dict['df_imdb_crew'].head()

,tconst,directors,writers,directors_list,writers_list
0,tt0285252,nm0899854,nm0899854,[nm0899854],[nm0899854]
1,tt0438973,NaN,"nm0175726,nm1802864",NaN,"[nm0175726, nm1802864]"
2,tt0462036,nm1940585,nm1940585,[nm1940585],[nm1940585]
3,tt0835418,nm0151540,"nm0310087,nm0841532",[nm0151540],"[nm0310087, nm0841532]"
4,tt0878654,"nm0089502,nm2291498,nm2292011",nm0284943,"[nm0089502, nm2291498, nm2292011]",[nm0284943]

In [458]:
print(len(df_dict['df_imdb_crew']['tconst'].unique()))
print(len(df_dict['df_imdb_crew']))

146144
146144

The imdb_crew table matches up `tconst` (movie IDs) with `nconst` (name IDs). However, although each movie is listed once (`tconst` is unique, the people are comma-separated lists. Need to split this into separate lookup tables where they're flattened, so I can join one-to-many and select individual writers and directors independent of specific movies.

In [459]:
# Make a new working dataframe
df_crew = df_dict['df_imdb_crew']

In [460]:
# Create a new column with the directors converted to a list
df_crew['directors_list'] = df_crew[
    df_crew['directors'].isna() == False]['directors'].map(
    lambda x: list(x.split(',')))
df_crew.head()

,tconst,directors,writers,directors_list,writers_list
0,tt0285252,nm0899854,nm0899854,[nm0899854],[nm0899854]
1,tt0438973,NaN,"nm0175726,nm1802864",NaN,"[nm0175726, nm1802864]"
2,tt0462036,nm1940585,nm1940585,[nm1940585],[nm1940585]
3,tt0835418,nm0151540,"nm0310087,nm0841532",[nm0151540],"[nm0310087, nm0841532]"
4,tt0878654,"nm0089502,nm2291498,nm2292011",nm0284943,"[nm0089502, nm2291498, nm2292011]",[nm0284943]

In [461]:
# Create a new column with the writers converted to a list
df_crew['writers_list'] = df_crew[
    df_crew['writers'].isna() == False]['writers'].map(
    lambda x: list(x.split(',')))
df_crew.head()

,tconst,directors,writers,directors_list,writers_list
0,tt0285252,nm0899854,nm0899854,[nm0899854],[nm0899854]
1,tt0438973,NaN,"nm0175726,nm1802864",NaN,"[nm0175726, nm1802864]"
2,tt0462036,nm1940585,nm1940585,[nm1940585],[nm1940585]
3,tt0835418,nm0151540,"nm0310087,nm0841532",[nm0151540],"[nm0310087, nm0841532]"
4,tt0878654,"nm0089502,nm2291498,nm2292011",nm0284943,"[nm0089502, nm2291498, nm2292011]",[nm0284943]

In [462]:
# Create yet another dataframe with just the directors and remove NaNs
df_directors = df_crew.loc[df_crew['directors_list'].isna() == False, ['tconst'
                                                        ,'directors_list']]
df_directors.isna().any().sum()

0

In [463]:
# Use explode to create a row for each director, with tconst duplicated
df_directors = df_directors.explode('directors_list', ignore_index=True)

print(f"Unique: {df_directors['tconst'].nunique()}")
print(f"Total Rows: {len(df_directors)}")
df_directors.head()

Unique: 140417
Total Rows: 163535

      tconst directors_list
0  tt0285252      nm0899854
1  tt0462036      nm1940585
2  tt0835418      nm0151540
3  tt0878654      nm0089502
4  tt0878654      nm2291498

In [464]:
df_directors.rename(columns={'directors_list':'nconst'}, inplace=True)

In [465]:
# Import our squeaky clean dataframe into SQL

df_directors.to_sql('imdb_directors', conn ,index=False)

sql = """SELECT * FROM imdb_directors LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tconst  5 non-null      object
 1   nconst  5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [466]:
conn.commit()

In [467]:
# Same deal with writers

# Create yet another dataframe with just the writers and remove NaNs
df_writers = df_crew.loc[df_crew['writers_list'].isna() == False, ['tconst'
                                                        ,'writers_list']]

# Use explode to create a row for each writers, with tconst duplicated
df_writers = df_writers.explode('writers_list', ignore_index=True)

print(f"Unique: {df_writers['tconst'].nunique()}")
print(f"Total Rows: {len(df_writers)}")

Unique: 110261
Total Rows: 178352

In [468]:
df_writers.rename(columns={'writers_list':'nconst'},inplace=True)

In [469]:
df_writers.to_sql('imdb_writers', conn ,index=False)

sql = """SELECT * FROM imdb_writers LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tconst  5 non-null      object
 1   nconst  5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [470]:
conn.commit()

### IMDB Datasets - Name Basics

In [471]:
df_dict['df_imdb_namebasics'].head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [472]:
df_name = df_dict['df_imdb_namebasics'][['nconst', 'primary_name', 'birth_year']]
df_name.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   nconst        606648 non-null  object
 1   primary_name  606648 non-null  object
 2   birth_year    82736 non-null   float64
dtypes: float64(1), object(2)
memory usage: 13.9+ MB

In [473]:
column_types = {'nconst':'TEXT', 'primary_name': 'TEXT', 'birth_year': 'INTEGER'}
df_name.to_sql('imdb_names', conn ,index=False, dtype=column_types)

In [474]:
sql = """SELECT * 
         FROM imdb_names 
         WHERE birth_year IS NOT NULL
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

      nconst           primary_name  birth_year
0  nm0063618              Jeff Beal        1963
1  nm0065847  Michael Frost Beckner        1963
2  nm0066093           Ahmad Bedair        1945
3  nm0066897  Mohammad-Ali Behboudi        1956
4  nm0067983        Krunoslav Belko        1971

In [475]:
conn.commit()

### IMDB Datasets - Principals

In [476]:
df_dict['df_imdb_principals'].head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [477]:
print(len(df_dict['df_imdb_principals']['nconst'].unique()))
print(len(df_dict['df_imdb_principals']))

604546
1028151

Hmm, so `tconst` definitely isn't unique, and `nconst` isn't unique either. I'm thinking maybe this is already exploded, and the duplicates are cases where a given person was both an actor and director, or held multiple roles. Let's check.

In [478]:
df_ppals = df_dict['df_imdb_principals']

In [479]:
# Let's preview some of the rows where nconst and tconst and category are the same

df_ppals[df_ppals.duplicated(subset=['nconst', 'tconst','category'], keep=False) == True]

Empty DataFrame
Columns: [tconst, ordering, nconst, category, job, characters]
Index: []

In [480]:
# I don't want to import duplicate data, so will drop duplicates for the 
# columns I will be using

df_ppals.drop_duplicates(subset=['nconst', 'tconst','category']
                         , keep='first', inplace=True)

In [481]:
df_ppals[['tconst','nconst', 'category']]

            tconst      nconst  category
0        tt0111414   nm0246005     actor
1        tt0111414   nm0398271  director
2        tt0111414   nm3739909  producer
3        tt0323808   nm0059247    editor
4        tt0323808   nm3579312   actress
...            ...         ...       ...
1028181  tt9692684   nm0186469     actor
1028182  tt9692684   nm4929530      self
1028183  tt9692684  nm10441594  director
1028184  tt9692684   nm6009913    writer
1028185  tt9692684  nm10441595  producer

[1028151 rows x 3 columns]

In [482]:
df_ppals['category'].value_counts()

"""
actor                  256700
director               146393
actress                146193
producer               113723
cinematographer         80091
composer                77063
writer                  74357
self                    65424
editor                  55511
production_designer      9373
archive_footage          3307
archive_sound              16
"""

'\nactor                  256700\ndirector               146393\nactress                146193\nproducer               113723\ncinematographer         80091\ncomposer                77063\nwriter                  74357\nself                    65424\neditor                  55511\nproduction_designer      9373\narchive_footage          3307\narchive_sound              16\n'

In [483]:
df_ppals[['tconst','nconst', 'category']].to_sql('imdb_principals', conn ,index=False)

sql = """SELECT * 
         FROM imdb_principals
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

      tconst     nconst  category
0  tt0111414  nm0246005     actor
1  tt0111414  nm0398271  director
2  tt0111414  nm3739909  producer
3  tt0323808  nm0059247    editor
4  tt0323808  nm3579312   actress

In [484]:
conn.commit()

### IMDB Datasets - Ratings

In [485]:
df_dict['df_imdb_ratings'].head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [486]:
df_dict['df_imdb_ratings'].describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [487]:
df_dict['df_imdb_ratings'].to_sql('imdb_ratings', conn ,index=False)

sql = """SELECT * 
         FROM imdb_ratings
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [489]:
conn.commit()

## Importing API-retrieved TMDB data

In [222]:
def df_str_to_iterable(df, trans_col, new_col, function):
    temp_s = df[df[trans_col].isna() == False][trans_col].map(function)
    df.insert(loc=len(df.columns), column=new_col, value=temp_s)
    return None

In [156]:
cd data

/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/data

In [157]:
batch1 = pickle.Unpickler(open('tmdb_moviedetails_batch1.pickle', 'rb')).load()

df_batch1 = pd.DataFrame(batch1)
df_batch1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10106 entries, 0 to 10105
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   adult                 10106 non-null  bool
 1   id                    10106 non-null  int64
 2   original_title        10106 non-null  object
 3   popularity            10106 non-null  float64
 4   video                 10106 non-null  bool
 5   budget                10106 non-null  int64
 6   genres                10106 non-null  object
 7   homepage              5 non-null      object
 8   imdb_id               10106 non-null  object
 9   original_language     10106 non-null  object
 10  overview              10106 non-null  object
 11  production_companies  10106 non-null  object
 12  production_countries  10106 non-null  object
 13  release_date          10106 non-null  object
 14  revenue               10106 non-null  int64
 15  runtime               10103 non-null  float64
 16  status                10106 non-null  object
 17  tagline               10106 non-null  object
 18  title                 10106 non-null  object
 19  vote_average          10106 non-null  float64
 20  vote_count            10106 non-null  int64
dtypes: bool(2), float64(3), int64(4), object(12)
memory usage: 1.5+ MB

In [170]:
df_batch1.head()

,id,original_title,popularity,video,budget,genres,imdb_id,original_language,overview,production_companies,production_countries,release_date,revenue,runtime,status,tagline,title,vote_average,vote_count
0,2,Ariel,8.455,False,0,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name...",tt0094675,fi,Taisto Kasurinen is a Finnish coal miner whose...,"[{'id': 2303, 'logo_path': None, 'name': 'Vill...","[{'iso_3166_1': 'FI', 'name': 'Finland'}]",1988-10-21,0,73.0,Released,,Ariel,6.8,128
1,3,Varjoja paratiisissa,6.696,False,0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",tt0092149,fi,"An episode in the life of Nikander, a garbage ...","[{'id': 2303, 'logo_path': None, 'name': 'Vill...","[{'iso_3166_1': 'FI', 'name': 'Finland'}]",1986-10-17,0,74.0,Released,,Shadows in Paradise,7.2,125
2,5,Four Rooms,13.794,False,4000000,"[{'id': 80, 'name': 'Crime'}, {'id': 35, 'name...",tt0113101,en,It's Ted the Bellhop's first night on the job....,"[{'id': 14, 'logo_path': '/m6AHu84oZQxvq7n1rsv...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-09,4257354,98.0,Released,Twelve outrageous guests. Four scandalous requ...,Four Rooms,5.7,1901
3,6,Judgment Night,12.455,False,21000000,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...",tt0107286,en,"While racing to a boxing match, Frank, Mike, J...","[{'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKX...","[{'iso_3166_1': 'JP', 'name': 'Japan'}, {'iso_...",1993-10-15,12136938,110.0,Released,Don't move. Don't whisper. Don't even breathe.,Judgment Night,6.5,184
4,11,Star Wars,84.275,False,11000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",tt0076759,en,Princess Leia is captured and held hostage by ...,"[{'id': 1, 'logo_path': '/o86DbpburjxrqAzEDhXZ...","[{'iso_3166_1': 'US', 'name': 'United States o...",1977-05-25,775398007,121.0,Released,"A long time ago in a galaxy far, far away...",Star Wars,8.2,15257

In [ ]:
df_batch1[df_batch1['adult']==True]

In [169]:
df_batch1.drop(columns=['adult', 'homepage'], inplace=True)

In [188]:
# Need to parse the genres, production_companies, and production_countries columns
# these are all dictionaries and I probably only want parts of them into lists
# , which I can then explode
# Also need to convert the release_date to a date

type(df_batch1.at[2, 'genres'])

list

In [219]:
# initial view of genres column. Separated out for working
df_batch1g = df_batch1[['id', 'genres']]
df_batch1g.head()

   id                                             genres
0   2  [{'id': 18, 'name': 'Drama'}, {'id': 80, 'name...
1   3  [{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...
2   5  [{'id': 80, 'name': 'Crime'}, {'id': 35, 'name...
3   6  [{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...
4  11  [{'id': 12, 'name': 'Adventure'}, {'id': 28, '...

In [223]:
# Add new column with genre IDs as a list
myfunc = lambda x: [i['id'] for i in x]
df_str_to_iterable(df_batch1g, 'genres', 'genreids_list', myfunc)

In [235]:
# Create a dictionary and start collecting all the ids and names for the genres
# eventually will write this to the table
genres_dict = {}

In [237]:
for value in df_batch1g['genres'].values:
    for x in value:
        genres_dict[x['id']] = x['name']

genres_dict.values()

dict_values(['Drama', 'Crime', 'Comedy', 'Action', 'Thriller', 'Adventure', 'Science Fiction', 'Animation', 'Family', 'Romance', 'Mystery', 'Horror', 'Fantasy', 'Documentary', 'War', 'Music', 'History', 'Western', 'TV Movie'])

In [240]:
df_batch1g_ex = df_batch1g[['id', 'genreids_list']].explode('genreids_list'
                                                           , ignore_index=True)

df_batch1g_ex

          id genreids_list
0          2            18
1          2            80
2          2            35
3          3            18
4          3            35
...      ...           ...
24570  20859            53
24571  20860            35
24572  20861            18
24573  20862            18
24574  20862            35

[24575 rows x 2 columns]

In [178]:
df_batch1.at[2, 'production_companies']

[{'id': 14,
  'logo_path': '/m6AHu84oZQxvq7n1rsvMNJIAsMu.png',
  'name': 'Miramax',
  'origin_country': 'US'},
 {'id': 59,
  'logo_path': '/yH7OMeSxhfP0AVM6iT0rsF3F4ZC.png',
  'name': 'A Band Apart',
  'origin_country': 'US'}]

In [244]:
# initial view of prodcomp column. Separated out for working
df_batch1pcomp = df_batch1[['id', 'production_companies']]
df_batch1pcomp.head()

# Add new column with prodcomp IDs as a list
myfunc = lambda x: [i['id'] for i in x]
df_str_to_iterable(df_batch1pcomp, 'production_companies', 'prodcomp_list', myfunc)

# Create a dictionary and start collecting all the ids and names for the prodcoms
# eventually will write this to the table
prodcomps_dict = {}

for value in df_batch1pcomp['production_companies'].values:
    for x in value:
        prodcomps_dict[x['id']] = [x['name'], x['origin_country']]

df_batch1pcomp_ex = df_batch1pcomp[['id', 'prodcomp_list']].explode('prodcomp_list'
                                                           , ignore_index=True)

df_batch1pcomp_ex

          id prodcomp_list
0          2          2303
1          3          2303
2          5            14
3          5            59
4          6            33
...      ...           ...
24447  20859         16953
24448  20860           NaN
24449  20861           NaN
24450  20862         12269
24451  20862            14

[24452 rows x 2 columns]

In [180]:
df_batch1.at[3, 'production_countries']

[{'iso_3166_1': 'JP', 'name': 'Japan'},
 {'iso_3166_1': 'US', 'name': 'United States of America'}]

In [246]:
# initial view of prodcoun column. Separated out for working
df_batch1pcoun = df_batch1[['id', 'production_countries']]
df_batch1pcoun.head()

# Add new column with prodcoun IDs as a list
myfunc = lambda x: [i['iso_3166_1'] for i in x]
df_str_to_iterable(df_batch1pcoun, 'production_countries', 'prodcouns_list', myfunc)

# Create a dictionary and start collecting all the ids and names for the prodcouns
# eventually will write this to the table
prodcouns_dict = {}

for value in df_batch1pcoun['production_countries'].values:
    for x in value:
        prodcouns_dict[x['iso_3166_1']] = x['name']

df_batch1pcoun_ex = df_batch1pcoun[['id', 'prodcouns_list']].explode('prodcouns_list'
                                                           , ignore_index=True)

df_batch1pcoun_ex

          id prodcouns_list
0          2             FI
1          3             FI
2          5             US
3          6             JP
4          6             US
...      ...            ...
13563  20859             CA
13564  20860            NaN
13565  20861            NaN
13566  20862             CA
13567  20862             US

[13568 rows x 2 columns]

In [248]:
df_batch1.head(1)

,id,original_title,popularity,video,budget,genres,imdb_id,original_language,overview,production_companies,production_countries,release_date,revenue,runtime,status,tagline,title,vote_average,vote_count
0,2,Ariel,8.455,False,0,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name...",tt0094675,fi,Taisto Kasurinen is a Finnish coal miner whose...,"[{'id': 2303, 'logo_path': None, 'name': 'Vill...","[{'iso_3166_1': 'FI', 'name': 'Finland'}]",1988-10-21,0,73.0,Released,,Ariel,6.8,128

In [251]:
cols_list = ['id', 'original_title', 'popularity', 'video', 'budget',
        'imdb_id', 'original_language', 'overview','release_date', 'revenue', 
        'runtime', 'status', 'tagline', 'title', 'vote_average', 'vote_count']
df_batch1[cols_list].to_sql('tmdb_movies', conn ,index=False)

sql = """SELECT * 
         FROM tmdb_movies
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

,id,original_title,popularity,video,budget,imdb_id,original_language,overview,release_date,revenue,runtime,status,tagline,title,vote_average,vote_count
0,2,Ariel,8.455,0,0,tt0094675,fi,Taisto Kasurinen is a Finnish coal miner whose...,1988-10-21,0,73.0,Released,,Ariel,6.8,128
1,3,Varjoja paratiisissa,6.696,0,0,tt0092149,fi,"An episode in the life of Nikander, a garbage ...",1986-10-17,0,74.0,Released,,Shadows in Paradise,7.2,125
2,5,Four Rooms,13.794,0,4000000,tt0113101,en,It's Ted the Bellhop's first night on the job....,1995-12-09,4257354,98.0,Released,Twelve outrageous guests. Four scandalous requ...,Four Rooms,5.7,1901
3,6,Judgment Night,12.455,0,21000000,tt0107286,en,"While racing to a boxing match, Frank, Mike, J...",1993-10-15,12136938,110.0,Released,Don't move. Don't whisper. Don't even breathe.,Judgment Night,6.5,184
4,11,Star Wars,84.275,0,11000000,tt0076759,en,Princess Leia is captured and held hostage by ...,1977-05-25,775398007,121.0,Released,"A long time ago in a galaxy far, far away...",Star Wars,8.2,15257

In [252]:
df_batch1g_ex.to_sql('tmdb_movie_genres', conn ,index=False)

sql = """SELECT * 
         FROM tmdb_movie_genres
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

   id  genreids_list
0   2             18
1   2             80
2   2             35
3   3             18
4   3             35

In [255]:
df_batch1pcomp_ex.to_sql('tmdb_movie_companies', conn ,index=False)

sql = """SELECT * 
         FROM tmdb_movie_companies
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

   id  prodcomp_list
0   2           2303
1   3           2303
2   5             14
3   5             59
4   6             33

In [256]:
df_batch1pcoun_ex.to_sql('tmdb_movie_countries', conn ,index=False)

sql = """SELECT * 
         FROM tmdb_movie_countries
         LIMIT 5"""

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

   id prodcouns_list
0   2             FI
1   3             FI
2   5             US
3   6             JP
4   6             US

In [257]:
conn.commit()

#### One-off Fix for batch 8 with the error

In [299]:
batch = pickle.Unpickler(open('tmdb_moviedetails_batch8.pickle', 'rb')).load()

df_batch = pd.DataFrame(batch)

In [354]:
df_batch.columns

Index(['adult', 'id', 'original_title', 'popularity', 'video', 'budget',
       'genres', 'imdb_id', 'original_language', 'overview',
       'production_companies', 'production_countries', 'release_date',
       'revenue', 'runtime', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [303]:
df_batch.loc[df_batch['id'] == 644910]

,adult,id,original_title,popularity,video,budget,genres,imdb_id,original_language,overview,production_companies,production_countries,release_date,revenue,runtime,status,tagline,title,vote_average,vote_count
5432,False,644910,Saturday Morning Cartoons: 1970s — Volume 1,6.65,False,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered,Exception encountered

In [305]:
df_batch.drop(index=5432, axis=0, inplace=True)

In [309]:
fixed_batch8 = df_batch.to_dict(orient='records')

pickle.Pickler(open(f'tmdb_moviedetails_batch8_fixed.pickle', 'wb')).dump(fixed_batch8)

### The Batch Import and Clean

In [355]:
ls

MovieData.csv*
ReadMe.pdf*
movie_ids_03_15_2021.json.gz
tmdb_moviedetails_batch1.pickle
tmdb_moviedetails_batch2.pickle
tmdb_moviedetails_batch3.pickle
tmdb_moviedetails_batch4.pickle
tmdb_moviedetails_batch5.pickle
tmdb_moviedetails_batch6.pickle
tmdb_moviedetails_batch7.pickle
tmdb_moviedetails_batch8.pickle
tmdb_moviedetails_batch8_fixed.pickle
tmdb_moviedetails_unpop_r3_batch_1.pickle
tmdb_moviedetails_unpop_r3_batch_2.pickle
tmdb_moviedetails_unpop_r3_batch_3.pickle
tmdb_moviedetails_unpop_r3_batch_4.pickle
unpop_firstrun/
unpop_firstrun_log.txt
unpop_secondrun/
unpop_secondrun_log.txt
watchmode_buy_titles_20210314.json
watchmode_free_titles_20210314.json
watchmode_rental_titles_20210314.json
watchmode_subscription_titles_20210314.json

In [357]:
# Assumes we already have dictionary variables to add the contants to

file_list = ['tmdb_moviedetails_batch1.pickle',
             'tmdb_moviedetails_batch2.pickle',
             'tmdb_moviedetails_batch3.pickle',
             'tmdb_moviedetails_batch4.pickle',
             'tmdb_moviedetails_batch5.pickle',
             'tmdb_moviedetails_batch6.pickle',
             'tmdb_moviedetails_batch7.pickle',
             'tmdb_moviedetails_batch8_fixed.pickle']
movie_cols = ['id', 'original_title', 'popularity', 'video', 'budget',
       'imdb_id', 'original_language', 'overview','release_date',
       'revenue', 'runtime', 'status', 'tagline', 'title', 'vote_average',
       'vote_count']

# all together now!
for file in file_list:
    # Open the pickled file
    batch = pickle.Unpickler(open(file, 'rb')).load()
    
    # Import file into dataframe
    df_batch = pd.DataFrame(batch)
    
    # Start Genres processing
    df_batchg = df_batch[['id', 'genres']]

    # Add new column with genre IDs as a list
    myfunc = lambda x: [i['id'] for i in x]
    df_str_to_iterable(df_batchg, 'genres', 'genreids_list', myfunc)

    for value in df_batchg['genres'].values:
        for x in value:
            genres_dict[x['id']] = x['name']

    df_batchg_ex = df_batchg[['id', 'genreids_list']].explode('genreids_list'
                                                               , ignore_index=True)
    
    # Start Production Companies processing
    df_batchpcomp = df_batch[['id', 'production_companies']]

    # Add new column with prodcomp IDs as a list
    myfunc = lambda x: [i['id'] for i in x]
    df_str_to_iterable(df_batchpcomp, 'production_companies', 'prodcomp_list', myfunc)

    for value in df_batchpcomp['production_companies'].values:
        for x in value:
            prodcomps_dict[x['id']] = [x['name'], x['origin_country']]

    df_batchpcomp_ex = df_batchpcomp[['id', 'prodcomp_list']].explode('prodcomp_list'
                                                               , ignore_index=True)
    # Start production countries processing
    df_batchpcoun = df_batch[['id', 'production_countries']]

    # Add new column with prodcoun IDs as a list
    myfunc = lambda x: [i['iso_3166_1'] for i in x]
    df_str_to_iterable(df_batchpcoun, 'production_countries', 'prodcouns_list', myfunc)

    for value in df_batchpcoun['production_countries'].values:
        for x in value:
            prodcouns_dict[x['iso_3166_1']] = x['name']

    df_batchpcoun_ex = df_batchpcoun[['id', 'prodcouns_list']].explode('prodcouns_list'
                                                               , ignore_index=True)
    
    # Rename columns in exploded df
    df_batchg_ex.rename(columns={'genreids_list': 'genre_id'}, inplace=True)
    df_batchpcomp_ex.rename(columns={'prodcomp_list': 'prodco_id'}, inplace=True)
    df_batchpcoun_ex.rename(columns={'prodcouns_list': 'iso'}, inplace=True)
    
    # Send each df to SQL, appending where table already exists
    df_batchg_ex.to_sql('tmdb_movie_genres', conn ,index=False, if_exists='append')
    df_batchpcomp_ex.to_sql('tmdb_movie_companies', conn ,index=False, if_exists='append')
    df_batchpcoun_ex.to_sql('tmdb_movie_countries', conn ,index=False, if_exists='append')
    
    # Don't forget the movies!
    df_batch[movie_cols].to_sql('tmdb_movies', conn, index=False, if_exists='append')
    
    conn.commit()

In [359]:
sql = """SELECT COUNT()
         FROM tmdb_movies
         """

df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
df

   COUNT()
0    80871

In [344]:
#sql = """ALTER TABLE tmdb_movie_countries 
#         RENAME COLUMN prodcouns_list TO iso"""

#df = pd.DataFrame(cur.execute(sql).fetchall(),columns=[x[0] for x in cur.description])
#df

Empty DataFrame
Columns: [1]
Index: []

In [346]:
conn.commit()

### Import constant tables from dicts

In [371]:
# Import genre, prod_comps, and prod_couns dictionaries into new tables.

# key = table name
# [
# First element (index 0) is the dictionary itself
# Second element (index 1) is a list of non-ID columns
# Third element (index 2) is the ID column name
#]
constants_dict = {'tmdb_genres': [genres_dict, ['genre'],'genre_id'], 
               'tmdb_prodco': [prodcomps_dict, ['name','origin_country'],'prodco_id'], 
               'tmdb_prodcountries': [prodcouns_dict, ['name'],'iso']}

for table in constants_dict.keys():
    # Create dataframe with dict keys as index
    df = pd.DataFrame.from_dict(data=constants_dict[table][0], orient='index'
                                , columns=constants_dict[table][1])
    
    # Make index a column
    df.reset_index(drop=False, inplace=True)
    
    #rename index columns
    df.rename(columns={'index': constants_dict[table][2]}, inplace=True)
    
    df.to_sql(table, conn ,index=False, if_exists='append')

sql = """SELECT name FROM sqlite_master WHERE type = 'table'"""

print(cur.execute(sql).fetchall())

[('tmdb_movie_genres',), ('tmdb_movie_companies',), ('tmdb_movie_countries',), ('tmdb_genres',), ('tmdb_prodco',), ('tmdb_prodcountries',)]

In [372]:
conn.commit()

In [348]:
prodcomps_dict

{2303: ['Villealfa Filmproductions', 'FI'],
 14: ['Miramax', 'US'],
 59: ['A Band Apart', 'US'],
 33: ['Universal Pictures', 'US'],
 1644: ['Largo Entertainment', 'US'],
 182: ['JVC', 'JP'],
 1: ['Lucasfilm Ltd.', 'US'],
 25: ['20th Century Fox', 'US'],
 3: ['Pixar', 'US'],
 4: ['Paramount', 'US'],
 21920: ['The Steve Tisch Company', ''],
 2721: ['Jinks/Cohen Company', ''],
 7: ['DreamWorks Pictures', 'US'],
 6: ['RKO Radio Pictures', 'US'],
 11447: ['Mercury Productions', ''],
 53671: ['Lantia Cinema & Audiovisivi', ''],
 8: ['Fine Line Features', ''],
 76: ['Zentropa Entertainments', 'DK'],
 119: ['Danmarks Radio (DR)', 'DK'],
 157: ['SVT Drama', ''],
 201: ['ARTE', 'FR'],
 321: ['Memfis Film', 'SE'],
 591: ['France 3 Cinéma', 'FR'],
 2996: ['Angel films', ''],
 5755: ['Constantin Film', 'DE'],
 5975: ['YLE', 'FI'],
 7330: ['Blind Spot Pictures', 'FI'],
 8659: ['VPRO', 'NL'],
 11239: ['Liberator Productions', 'FR'],
 14937: ['Icelandic Film', 'IS'],
 30268: ['Pain Unlimited GmbH Filmproduktion', ''],
 53667: ['Trust Film Svenska', ''],
 53668: ['Cinematograph A/S', ''],
 53669: ['What Else? B.V', ''],
 53670: ['Filmek A/S', ''],
 6705: ['Film4 Productions', 'GB'],
 104: ['Canal+', 'FR'],
 94: ['ARTE France Cinéma', 'FR'],
 2801: ['Film i Väst', 'SE'],
 447: ['TV 1000 Sverige', 'SE'],
 46: ['WDR', 'DE'],
 47: ['Constantin Film', 'DE'],
 248: ['Impact Pictures', 'CA'],
 2268: ['Isle of Man Film', 'GB'],
 2452: ['UK Film Council', 'GB'],
 9: ['Gaumont', 'FR'],
 12372: ['UFA', 'DE'],
 49: ['El Deseo', 'ES'],
 77: ['Milestone Productions', ''],
 13723: ['Bruce Brown Films', ''],
 2: ['Walt Disney Pictures', 'US'],
 130: ['Jerry Bruckheimer Films', 'US'],
 39121: ['Super Cool ManChu', ''],
 14440: ['Red Wagon Entertainment', 'US'],
 1522: ['Neal Street Productions', 'GB'],
 19934: ['Motion Picture KAPPA Produktionsgesellschaft', ''],
 15: ['Lama Films', 'PS'],
 16: ['United King Films', 'IL'],
 163: ['Revolution Films', 'GB'],
 60: ['United Artists', 'US'],
 70: ['American Zoetrope', 'US'],
 11671: ['Studio 4°C', 'JP'],
 174: ['Warner Bros. Pictures', 'US'],
 171: ['Malpaso Productions', 'US'],
 80853: ['AKOM Production Company', ''],
 18: ['Gracie Films', 'US'],
 96084: ['Rough Draft Feature Animation', ''],
 19: ['Film Roman', 'US'],
 11749: ['20th Century Fox Animation', 'US'],
 29500: ['The Curiosity Company', 'US'],
 10146: ['Focus Features', 'US'],
 10039: ['Anonymous Content', 'US'],
 10059: ['This Is That Productions', ''],
 5084: ['Altavista Films', ''],
 110056: ['Zeta Film (MX)', ''],
 19936: ['Second Mate Productions', 'US'],
 12: ['New Line Cinema', 'US'],
 6363: ['BenderSpink', ''],
 429: ['DC Comics', 'US'],
 385: ['Stanley Kubrick Productions', 'GB'],
 21: ['Metro-Goldwyn-Mayer', 'US'],
 507: ['Atlas Entertainment', 'US'],
 17031: ['Classico', ''],
 357: ['Vía Digital', 'ES'],
 10565: ['Good Machine', 'US'],
 29566: ['Atresmedia', 'ES'],
 24: ['Mikona Productions GmbH & Co. KG', 'DE'],
 23: ['Imagine Entertainment', 'US'],
 5: ['Columbia Pictures', 'US'],
 97: ['Castle Rock Entertainment', 'US'],
 850: ['Eurimages', 'FR'],
 89: ['Augustus Film', ''],
 91: ['Lama Productions', ''],
 93: ['Lumer Films', ''],
 95: ['Hazazah Film', ''],
 315: ['Filmstiftung Nordrhein-Westfalen', 'DE'],
 703: ['Razor Film Produktion', 'DE'],
 4508: ['Nederlands Fonds voor de Film', 'NL'],
 451: ['Medienboard Berlin-Brandenburg', 'DE'],
 10214: ['Embassy International Pictures', 'US'],
 6402: ['Mars Media Beteiligungs', ''],
 84: ['Tree Line Films', ''],
 85: ['Konrad Pictures', ''],
 86: ['Catfish Productions', ''],
 711: ['Fox 2000 Pictures', 'US'],
 126: ['Lakeshore Entertainment', 'US'],
 1171: ['Epsilon Motion Pictures', 'CH'],
 16311: ['Albert S. Ruddy Productions', ''],
 694: ['StudioCanal', 'FR'],
 288: ['BBC Films', 'GB'],
 686: ['Tiger Aspect Productions', 'GB'],
 718: ['Arts Council of England', 'GB'],
 10163: ['Working Title Films', 'GB'],
 10462: ['WT2 Productions', ''],
 11308: ['Savoy Pictures', ''],
 924: ['The Turman-Morrissey Company', ''],
 56: ['Amblin Entertainment', 'US'],
 44: ['Cruise/Wagner Productions', ''],
 8601: ['Tim Burton Productions', ''],
 104576: ['Filmhaus Films', 'AT'],
 11510: ['Detour Filmproduction', 'US'],
 491: ['Summit Entertainment', 'US'],
 506: ['Newmarket Capital Group', 'US'],
 598: ['Team Todd', ''],
 34446: ['I Remember Productions', ''],
 5798: ['Shaw Brothers', 'HK'],
 7965: ['The Ladd Company', 'US'],
 724: ['Beijing New Picture Film Co. Ltd.', ''],
 2269: ['China Film Co-Production Corporation', ''],
 11509: ['Warner Independent Pictures (WIP)', 'US'],
 29: ['Topcraft', 'JP'],
 52846: ['Metropolis Films', 'UY'],
 675: ['Forward Pass', 'US'],
 52844: ['Motion Picture ETA Produktionsgesellschaft', ''],
 52845: ['Foqus Arte Digital', 'PY'],
 65822: ['Michael Mann Productions', ''],
 22376: ['Plunge Pictures LLC', ''],
 74: ['MOOVIE GmbH', 'DE'],
 75: ['Medienfonds German Film Productions GmbH & Co. KG', ''],
 137: ['Great American Films Limited Partnership', ''],
 12360: ['Vestron Pictures', ''],
 30: ['Eddie Murphy Productions', 'US'],
 10288: ['Don Simpson/Jerry Bruckheimer Films', 'US'],
 85869: ['Ramón Acín', ''],
 9195: ['Touchstone Pictures', 'US'],
 11533: ['Valhalla Motion Pictures', 'US'],
 558: ['Lisberger/Kushner', ''],
 3166: ['Walt Disney Productions', 'US'],
 1645: ['Scott Free Productions', 'GB'],
 21904: ['Mill Film', 'GB'],
 21905: ['C & L', 'MT'],
 21906: ['Dawliz', 'MA'],
 82: ['Renn Productions', ''],
 83: ['France 2 Cinéma', 'FR'],
 13419: ['SKA Films', ''],
 1382: ['PolyGram Filmed Entertainment', 'US'],
 20076: ['HandMade Films', 'GB'],
 66743: ['Les Films du Dauphin', 'FR'],
 118: ['Det Danske Filminstitut', 'DK'],
 46059: ['Italo/Judeo Productions', ''],
 46060: ['Bill/Phillips', ''],
 96: ['X Filme Creative Pool', 'DE'],
 342: ['Davis Films', 'FR'],
 1885: ['Silver Pictures', 'US'],
 840: ['Lawrence Gordon Productions', ''],
 5263: ['Amercent Films', ''],
 5264: ['American Entertainment Partners L.P.', ''],
 3287: ['Screen Gems', 'US'],
 1610: ['CED Productions', ''],
 183: ['Le Studio Canal+', 'FR'],
 38: ['Zespół Filmowy TOR', 'PL'],
 1245: ['TSR', 'CH'],
 139: ['LJ Film', 'KR'],
 11554: ['Korea Pictures', 'KR'],
 685: ['Cineclick Asia', 'KR'],
 11555: ['Cinesoul', ''],
 11556: ['Mirae Asset Capital', ''],
 11557: ['Muhan Investment', ''],
 140: ['Pandora Film', 'DE'],
 10282: ['Silver Screen Partners IV', 'US'],
 37: ['Gramercy Pictures', 'US'],
 79: ['Village Roadshow Pictures', 'US'],
 80: ['The Zanuck Company', 'US'],
 55512: ['Theobald Film Productions', ''],
 81: ['Plan B Entertainment', 'US'],
 11: ['WingNut Films', 'NZ'],
 5237: ['The Saul Zaentz Company', 'US'],
 286: ['Fantasy Films', ''],
 4921: ['Bakshi Productions', ''],
 141322: ['Saul Zaentz Film Productions', ''],
 1587: ['P.P. Film Polski', 'PL'],
 73037: ['Studio Filmowe Tor', 'PL'],
 10342: ['Studio Ghibli', 'JP'],
 12516: ['Nibariki', 'JP'],
 2752: ['DENTSU Music And Entertainment', 'JP'],
 67681: ['TNDG', ''],
 1779: ['Tokuma Shoten', 'JP'],
 6755: ['Nippon Television Network Corporation', 'JP'],
 14563: ['Maysles Films', 'US'],
 2401: ['Drew Associates', ''],
 2402: ['Time', ''],
 2092: ['Mike Zoss Productions', 'US'],
 39: ['Docurama', ''],
 91189: ['PENNEBAKER-LEACOCK, INC', ''],
 155: ['Nimbus Film', 'DK'],
 9335: ['Canal+ España', 'ES'],
 981: ['TVE', 'ES'],
 19813: ['Flower Films', 'US'],
 5367: ['Gaylord Films', ''],
 3334: ['Adam Fields Productions', ''],
 185: ['Pandora Cinema', ''],
 1246: ['River Road Entertainment', 'US'],
 3997: ['Alberta Film Entertainment', ''],
 6116: ['Argos Films', 'FR'],
 8366: ['Road Movies Filmproduktion', 'DE'],
 36229: ['Wim Wenders Stiftung', 'DE'],
 123: ['Trust Film', ''],
 2798: ['Columbia Pictures Film Production Asia', ''],
 12205: ['EDKO Film', ''],
 20289: ['Asia Union Film & Entertainment Ltd.', ''],
 20290: ['United China Vision', ''],
 20291: ['Zoom Hunt International Productions Company Ltd.', ''],
 53: ['Les Films du Carrosse', 'FR'],
 10897: ['Sédif Productions', 'FR'],
 78: ['Hotshot Films', 'RU'],
 10920: ['Akira Committee Company Ltd.', ''],
 3363: ['Mainichi Broadcasting System (MBS)', ''],
 10921: ['Sumitomo Corporation', 'JP'],
 882: ['Toho Company, Ltd.', 'JP'],
 104680: ['Studio Fuga', 'JP'],
 5805: ['Studio Aoi', 'JP'],
 7164: ['TMS Entertainment', 'JP'],
 59118: ['Kodansha', 'JP'],
 120107: ['Bandai Entertainment Inc.', ''],
 1780: ['Tohokushinsha Film Corporation', 'JP'],
 113241: ['Elemental Films', 'GB'],
 923: ['Legendary Pictures', 'US'],
 9996: ['Syncopy', 'GB'],
 118865: ['Isobel Griffiths', 'GB'],
 9993: ['DC Entertainment', 'US'],
 223: ['Les Films du Losange', 'FR'],
 235: ['Nordisk Film', 'DK'],
 698: ['Scottish Screen', ''],
 758: ['TV 2', 'DK'],
 980: ['The Glasgow Film Fund', ''],
 1478: ['Sat.1', 'DE'],
 99: ['Olga-Film GmbH (München)', ''],
 11793: ['Lumière', ''],
 172: ['NPV Entertainment', 'US'],
 2596: ['Jerry Weintraub Productions', 'US'],
 129: ['Section Eight', 'US'],
 12202: ['WV Films III', ''],
 11355: ['Jurow-Shepherd', ''],
 28766: ['Productions Marcel Dassault', 'FR'],
 7961: ['Gaumont International', 'FR'],
 763: ['Intermedia Films', ''],
 1178: ['Pathé Pictures International', 'GB'],
 19116: ['IMF Internationale Medien und Film GmbH & Co. 3. Produktions KG',
  'DE'],
 1302: ['Davis Entertainment', 'US'],
 284: ['DNA Films', 'GB'],
 2061: ['Twisted Pictures', 'US'],
 23019: ['Evolution Entertainment', ''],
 55405: ['Saw Productions Inc.', ''],
 1632: ['Lionsgate', 'US'],
 559: ['TriStar Pictures', 'US'],
 2231: ['Trilogy Entertainment Group', 'US'],
 932: ['Mirage Enterprises', 'US'],
 11581: ['Misher Films', 'US'],
 20194: ['Motion Picture JOTA Produktions', ''],
 76068: ['Digital Image Associates', ''],
 766: ['Blue Tulip Productions', ''],
 26265: ['Ronald Shusett/Gary Goldman', ''],
 70319: ['Sunset Gower Studios', ''],
 275: ['Carolco Pictures', 'US'],
 20986: ['Finnegan/Pinchuk Productions', ''],
 112267: ['Pipeline Productions', ''],
 2253: ['Lawrence Bender Productions', 'US'],
 114715: ['Mighty Mighty Afrodite Productions', ''],
 88: ['Hawk Films', ''],
 308: ['The Weinstein Company', 'US'],
 816: ['FilmEngine', ''],
 826: ['Capitol Films', 'GB'],
 1204: ['Ascendant Pictures', 'US'],
 2116: ['VIP Medienfonds 4', ''],
 123780: ['Lucky Number Slevin Productions Inc.', ''],
 54502: ["Mel's Cite du Cinema", ''],
 123781: ['The Complex', ''],
 7405: ['Dimension Films', 'US'],
 10807: ['Troublemaker Studios', 'US'],
 41658: ['Residaco', ''],
 11006: ['Aldamisa Entertainment', ''],
 13241: ['Demarest Films', ''],
 29076: ['Solipsist Film', ''],
 11005: ['AR Films', ''],
 45693: ['Cristaldifilm', ''],
 7110: ['Les Films Ariane', 'FR'],
 4606: ['ZDF', 'DE'],
 1583: ['RAI', 'IT'],
 592: ['Claudie Ossard Productions', ''],
 4411: ['MMC Independent', ''],
 12000: ['Tapioca Films', ''],
 23446: ['Sofica Sofinergie 5', ''],
 25020: ['Victoires Productions', ''],
 7248: ['Union Générale Cinématographique (UGC)', 'FR'],
 4564: ['Icon Entertainment International', 'GB'],
 11353: ['B.H. Finance C.V.', ''],
 120: ['Scorsese Productions', ''],
 11788: ['Compagnie Industrielle et Commerciale Cinématographique (CICC)', ''],
 141: ['Véra Films', 'FR'],
 144: ['Fono Roma', ''],
 534: ['Filmsonor', 'FR'],
 7495: ['Sixth Sense Productions', ''],
 35: ['Lions Gate Films', 'US'],
 564: ['Industrial Development Corporation of South Africa', ''],
 2760: ['Miracle Pictures', ''],
 19834: ['Inside Track Films', ''],
 11912: ['Mikado Film', 'IT'],
 1205: ['Endgame Entertainment', 'US'],
 1053: ['Got Films', ''],
 64651: ['Saw 2 Productions', ''],
 11626: ['Tango Film', 'DE'],
 10869: ['Filmverlag der Autoren', 'DE'],
 862: ['The Kennedy/Marshall Company', 'US'],
 41: ['Orion Pictures', 'US'],
 1280: ['Pacific Western', 'US'],
 3952: ['Hemdale Film', ''],
 4764: ['Cinema 84', ''],
 7745: ['Euro Film Funding', ''],
 50: ['Deutsche Vereinsfilm AG', 'DE'],
 51: ['Fox Europa Produktion', ''],
 1553: ['Selznick International Pictures', 'US'],
 6804: ['Zespól Filmowy "X"', ''],
 52: ['Film Polski Film Agency', ''],
 307: ['IFC Films', 'US'],
 43: ['Fox Searchlight Pictures', 'US'],
 54: ['The Independent Film Channel Productions', 'US'],
 1422: ['Killer Films', 'US'],
 11351: ['Hart-Sharp Entertainment', ''],
 6735: ['Participant Media', 'US'],
 20665: ['4M', ''],
 7786: ['FilmWorks', ''],
 20666: ['MID Foundation', ''],
 14150: ['Orion Pictures Corporation', ''],
 14772: ['Warner Bros. Home Entertainment Group', ''],
 55: ['Decla Film Gesellschaft Holz & Co.', ''],
 56485: ['Act III Productions', 'US'],
 105: ['CiBy 2000', 'FR'],
 11840: ['Film Victoria', 'AU'],
 39250: ['House & Moorhouse Films', ''],
 11561: ['Recorded Picture Company', 'GB'],
 10211: ['Alfran Productions', 'US'],
 219: ['The Mirisch Company', 'US'],
 11982: ['Ashton Productions', ''],
 536: ['The Coppola Company', 'US'],
 68551: ['J D Productions', ''],
 508: ['Regency Enterprises', 'US'],
 644: ['Alcor Films', ''],
 4198: ['Ixtlan', ''],
 10104: ['New Regency Pictures', 'US'],
 32: ['Buena Vista Pictures', ''],
 567: ['Office Kitano', 'JP'],
 568: ['Saito Entertainment', ''],
 569: ['Tokyo FM Broadcasting Company', ''],
 528: ['Bandai Visual', 'JP'],
 52795: ['Harris-Kubrick Productions', ''],
 1044: ['Franton Production', 'US'],
 216: ['Jersey Films', ''],
 165: ['Steen Herdel Filmproduktion', ''],
 3434: ['David L. Wolper Productions', 'US'],
 137130: ['The Quaker Oats Company', ''],
 7576: ['Eon Productions', 'GB'],
 10761: ['Danjaq', 'US'],
 68: ['Big Primate Pictures', ''],
 69: ['MFPV Film', ''],
 64: ['Les Productions Artistes Associés', ''],
 2979: ['ETIC Films', ''],
 355: ['R.P. Productions', 'FR'],
 6732: ['Runteam III Ltd.', ''],
 72: ['Valoria Films', ''],
 73: ['Fida Cinematografica', 'IT'],
 4978: ['Gaumont-British Picture Corporation', 'GB'],
 100: ['Avon Production', ''],
 8658: ['Rialto Films', ''],
 101: ['Roxy Film', 'DE'],
 14309: ['CIP Filmproduktion GmbH', ''],
 162: ['Bayerischer Rundfunk', 'DE'],
 109: ['Rome Paris Films', ''],
 1714: ['Les Films Concordia', ''],
 10000: ['Compagnia Cinematografica Champion', ''],
 127499: ['Polygram Entertainment', 'US'],
 4357: ['The Guber-Peters Company', ''],
 249: ['Société Nouvelle de Cinématographie', ''],
 10906: ['Les Films Impéria', ''],
 10907: ['Les Productions Georges de Beauregard', ''],
 113: ['Svenska Ord', 'SE'],
 115: ['FilmTeknik', 'SE'],
 6181: ['Svensk Filmindustri', 'SE'],
 12984: ['Norsk Film', 'NO'],
 2999: ['SVT', 'SE'],
 116: ['Cameo Film- und Fernsehproduktion', ''],
 117: ['Kunsthochschule für Medien Köln', 'DE'],
 55072: ['Strong Heart/Demme Production', 'US'],
 121: ['Y3 Film', ''],
 122: ['Coop 99 Filmproduktion', 'AT'],
 124: ['Südwestrundfunk', 'DE'],
 7733: ['Laurinfilm', ''],
 7734: ['Subterranean Productions LLC', ''],
 7735: ['Subterranean Productions UK Ltd.', ''],
 7736: ['Underworld Produktions GmbH', ''],
 1869: ['AMLF', ''],
 574: ['Lightstorm Entertainment', 'US'],
 736: ['Little Shark Entertainment', 'DE'],
 1312: ['The Mount Company', 'US'],
 893: ['Stanley Kramer Productions', 'US'],
 11273: ['Circle Films', ''],
 2448: ['Yari Film Group', ''],
 80277: ['Desert Hearts Productions', ''],
 798: ['Samuel Goldwyn Company', 'US'],
 7340: ['C-2 Pictures', ''],
 23636: ['Mostow/Lieberman Productions', ''],
 136: ['City Light Films', 'US'],
 67993: ['Dorchester', ''],
 11911: ['Partizan Films', ''],
 6586: ['TPS Star', 'FR'],
 73577: ['Armada Productions', ''],
 147: ['Fidélité Productions', ''],
 148: ['Gimages', ''],
 149: ['FOZ', 'FR'],
 150: ['Headforce Ltd.', ''],
 153: ['Minerva Film SpA', ''],
 193: ['Excelsa Films', ''],
 208: ['Bac Films', 'FR'],
 22456: ['Five Roses', 'US'],
 160: ['Pit Bull Productions', ''],
 158: ['Spyglass Entertainment', 'US'],
 159: ['Shady Acres Entertainment', 'US'],
 11670: ['Producers Sales Organization (PSO)', ''],
 218: ['Rafran Cinematografica', ''],
 164: ['Rhombus Media', 'CA'],
 813: ['Di Novi Pictures', 'US'],
 52945: ['Frantic Films', 'CA'],
 52946: ['Maple Shade Films', 'US'],
 52947: ['Catwoman Films', ''],
 170: ['Eve Productions Inc.', ''],
 167: ['Deblokada', 'BA'],
 168: ['Jadran Film', 'HR'],
 169: ['Noirfilm', ''],
 1490: ['Kintop Pictures', 'US'],
 10210: ['Morgan Creek Productions', 'US'],
 3322: ['August Entertainment', ''],
 1088: ['Alcon Entertainment', 'US'],
 1089: ['Witt/Thomas Productions', ''],
 4096: ['icon', ''],
 11562: ['Fuzzy Bunny Films (I)', ''],
 11563: ['Little Brother Inc.', ''],
 6516: ['Tokyo FM Broadcasting Co.', ''],
 20477: ['DiC Entertainment', 'US'],
 175: ['Caravan Pictures', 'US'],
 176: ['Different Tree Same Wood Productions', ''],
 178: ['Ghoulardi Film Company', 'US'],
 179: ['The Magnolia Project', ''],
 11386: ['Finanzia San Marco', ''],
 8930: ['Euro International Film', 'IT'],
 25287: ['San Marco', ''],
 189: ['ARP Sélection', 'FR'],
 24033: ['France 5', 'FR'],
 181: ['Channel Four Films', 'GB'],
 184: ['Locus Solus Entertainment', ''],
 186: ['Pyramide Productions', 'FR'],
 187: ['Victor Musical Industries, Inc.', 'JP'],
 11345: ['Stillking Films', 'CZ'],
 54285: ['Telegraph Films', ''],
 188: ['Big Beach', 'US'],
 190: ['Alice Productions', ''],
 161: ['Claussen+Wöbke Filmproduktion', 'DE'],
 8465: ['Traumwerk Filmproduktion GmbH', ''],
 5011: ['Becker & Häberle Filmproduktion GmbH', 'DE'],
 191: ['Senator Film', 'DE'],
 1251: ['ARD', 'DE'],
 194: ['Hobby Films', ''],
 195: ['Pole Star', 'US'],
 86602: ['Filmstudio 1929', ''],
 196: ['Filmstudio Berlin', ''],
 19747: ['Brandywine Productions', 'US'],
 444: ['Dune Entertainment', 'US'],
 445: ['Major Studio Partners', 'US'],
 682: ['Peninsula Films', ''],
 200: ['Corazón International', ''],
 203: ['Panfilm', ''],
 204: ['Wüste Filmproduktion', 'DE'],
 11731: ['Bavaria Film International', ''],
 7201: ['NDR', 'DE'],
 1531: ['Smart Egg Pictures', 'GB'],
 206: ['Star Partners II Ltd.', ''],
 209: ['Radiant Film GmbH', ''],
 210: ['Südwestdeutscher Rundfunk', 'DE'],
 1704: ['Bavaria Film', 'DE'],
 11344: ['Twin Bros. Productions', ''],
 4319: ['40 Acres and a Mule Filmworks', 'US'],
 10212: ['Orion-Nova Productions', ''],
 11143: ['Madragoa Filmes', 'PT'],
 10481: ['Jolly Film', ''],
 19498: ['Ocean Films', ''],
 65781: ['Fat Free', ''],
 903: ['David Brown Productions', ''],
 76043: ['Revolution Sun Studios', 'US'],
 264: ['Studio Babelsberg', 'DE'],
 19828: ['Lonlink Productions', ''],
 19829: ['Kut Productions', ''],
 19835: ['Charenton Productions Limited', ''],
 1684: ['Chenault Productions', ''],
 34207: ['Prufrock Pictures', ''],
 213: ["Cooper's Town Productions", ''],
 54280: ['Infinity Media', ''],
 54281: ['A-Line Pictures', ''],
 63576: ['Eagle Vision', 'CA'],
 215: ['Double Feature Films', 'US'],
 11728: ['Camelot Pictures', ''],
 11729: ["Large's Ark Productions", ''],
 2630: ['Majestic Films International', ''],
 373: ['Asymmetrical Productions', ''],
 635: ['Les Films Alain Sarde', 'FR'],
 637: ['The Picture Factory', ''],
 59423: ['The Straight Story, Inc', ''],
 217: ['Ponti-De Laurentiis Cinematografica', ''],
 22684: ['Kasso Productions', 'FR'],
 16366: ['La Sept Cinéma', 'FR'],
 5869: ['Les Productions Lazennec', 'FR'],
 23153: ['Wüste Film', 'DE'],
 12204: ['Tiger Moth Productions', ''],
 166: ['Peter Rommel Productions', ''],
 10221: ['Walden Media', 'US'],
 23449: ['American Empirical Pictures', 'US'],
 258: ['Scott Rudin Productions', 'US'],
 9387: ['Cineriz', ''],
 10882: ['Francinex', 'FR'],
 250: ['Canal+ Polska', 'PL'],
 260: ['Heritage Films', 'PL'],
 266: ['Agencja Produkcji Filmowej', 'PL'],
 268: ['FilmFernsehFonds Bayern', 'DE'],
 269: ['Filmboard Berlin-Brandenburg (FBB)', 'DE'],
 6480: ['TVP', 'PL'],
 265: ['Runteam', 'GB'],
 2026: ['FFA', 'DE'],
 9383: ['Blue Sky Studios', 'US'],
 10715: ['Alfred J. Hitchcock Productions', 'US'],
 13800: ['Gaumont Distribution', ''],
 30847: ['Specta Films', ''],
 7816: ['Gray Film', ''],
 21172: ['Alter Films', ''],
 93469: ['Film del Centauro', ''],
 478: ['Cady', ''],
 7508: ['PEA', 'IT'],

In [353]:
sql = """DROP TABLE tmdb_movies"""

cur.execute(sql)

## Importing Filtered TMDb movies with extended properties

In [445]:
cd '/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/data'

/Users/jessicamiles/Documents/Flatiron_Data_Science/git_labs_lessons/phase1/dsc-phase-1-project/data

In [446]:
# Open the pickled file
batch = pickle.Unpickler(open('tmdb_moviedetails_filtered_fixed.pickle', 'rb')).load()

# Import file into dataframe
df_batch = pd.DataFrame(batch)

In [447]:
df_batch.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6495 entries, 0 to 6494
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    6495 non-null   int64
 1   popularity            6495 non-null   float64
 2   budget                6495 non-null   int64
 3   genres                6495 non-null   object
 4   imdb_id               6339 non-null   object
 5   original_language     6495 non-null   object
 6   overview              6495 non-null   object
 7   production_companies  6495 non-null   object
 8   production_countries  6495 non-null   object
 9   release_date          6495 non-null   object
 10  revenue               6495 non-null   int64
 11  runtime               6466 non-null   float64
 12  status                6495 non-null   object
 13  tagline               6495 non-null   object
 14  title                 6495 non-null   object
 15  original_title        6495 non-null   object
 16  vote_average          6495 non-null   float64
 17  vote_count            6495 non-null   int64
 18  watch/providers       6495 non-null   object
 19  release_dates         6495 non-null   object
dtypes: float64(3), int64(4), object(13)
memory usage: 1015.0+ KB

In [381]:
# didn't finish this, going to come back to it if I have time.
df_batch['release_dates'][0]

mpaa_rating = df_batch['release_dates'][0]

mpaa_rating

[{'iso_3166_1': 'US',
  'release_dates': [{'certification': 'PG',
    'iso_639_1': '',
    'note': '',
    'release_date': '2021-03-05T00:00:00.000Z',
    'type': 3},
   {'certification': 'PG',
    'iso_639_1': None,
    'note': 'Disney+ Premier Access',
    'release_date': '2021-03-05T00:00:00.000Z',
    'type': 4}]}]

In [ ]:
list(filter(lambda r: r['iso_3166_1'] == 'US', df_batch['release_dates'][0])
    )[0]['release_dates'][0]['certification']

In [400]:
df_batch[df_batch['id'] == '']

,id,popularity,budget,genres,imdb_id,original_language,overview,production_companies,production_countries,release_date,revenue,runtime,status,tagline,title,original_title,vote_average,vote_count,watch/providers,release_dates
6361,,,,,,,,,,,,,,,,,,,,
6481,,,,,,,,,,,,,,,,,,,,
6494,,,,,,,,,,,,,,,,,,,,

In [399]:
df_batch['id'] = df_batch['id'].astype(int)

ValueError: invalid literal for int() with base 10: ''

In [451]:
sql = """SELECT name FROM sqlite_master WHERE type = 'table'"""

print(cur.execute(sql).fetchall())

[('tmdb_movie_genres',), ('tmdb_movie_companies',), ('tmdb_movie_countries',), ('tmdb_genres',), ('tmdb_prodco',), ('tmdb_prodcountries',), ('tmdb_movies',)]

In [369]:
# Start Genres processing
df_batchg = df_batch[['id', 'genres']]

# Add new column with genre IDs as a list
myfunc = lambda x: [i['id'] for i in x]
df_str_to_iterable(df_batchg, 'genres', 'genreids_list', myfunc)

for value in df_batchg['genres'].values:
    for x in value:
        genres_dict[x['id']] = x['name']

df_batchg_ex = df_batchg[['id', 'genreids_list']].explode('genreids_list'
                                                           , ignore_index=True)

# Start Production Companies processing
df_batchpcomp = df_batch[['id', 'production_companies']]

# Add new column with prodcomp IDs as a list
myfunc = lambda x: [i['id'] for i in x]
df_str_to_iterable(df_batchpcomp, 'production_companies', 'prodcomp_list', myfunc)

for value in df_batchpcomp['production_companies'].values:
    for x in value:
        prodcomps_dict[x['id']] = [x['name'], x['origin_country']]

df_batchpcomp_ex = df_batchpcomp[['id', 'prodcomp_list']].explode('prodcomp_list'
                                                           , ignore_index=True)
# Start production countries processing
df_batchpcoun = df_batch[['id', 'production_countries']]

# Add new column with prodcoun IDs as a list
myfunc = lambda x: [i['iso_3166_1'] for i in x]
df_str_to_iterable(df_batchpcoun, 'production_countries', 'prodcouns_list', myfunc)

for value in df_batchpcoun['production_countries'].values:
    for x in value:
        prodcouns_dict[x['iso_3166_1']] = x['name']

df_batchpcoun_ex = df_batchpcoun[['id', 'prodcouns_list']].explode('prodcouns_list'
                                                           , ignore_index=True)

# Rename columns in exploded df
df_batchg_ex.rename(columns={'genreids_list': 'genre_id'}, inplace=True)
df_batchpcomp_ex.rename(columns={'prodcomp_list': 'prodco_id'}, inplace=True)
df_batchpcoun_ex.rename(columns={'prodcouns_list': 'iso'}, inplace=True)

# Send each df to SQL, appending where table already exists
df_batchg_ex.to_sql('tmdb_movie_genres', conn ,index=False, if_exists='append')
df_batchpcomp_ex.to_sql('tmdb_movie_companies', conn ,index=False, if_exists='append')
df_batchpcoun_ex.to_sql('tmdb_movie_countries', conn ,index=False, if_exists='append')

conn.commit()

In [410]:
# Don't forget the movies!

movie_cols = ['id', 'original_title', 'popularity', 'budget',
       'imdb_id', 'original_language', 'overview','release_date',
       'revenue', 'runtime', 'status', 'tagline', 'title', 'vote_average',
       'vote_count']

df_batch[movie_cols].to_sql('tmdb_movies', conn, index=False, if_exists='append')

conn.commit()

In [393]:
sql2 = """SELECT *
         FROM tmdb_movie_genres m
         LIMIT 5
         """

df = pd.DataFrame(cur.execute(sql2).fetchall(),columns=[x[0] for x in cur.description])

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        5 non-null      object
 1   genre_id  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [258]:
sql = """SELECT name FROM sqlite_master WHERE type = 'table'"""

print(cur.execute(sql).fetchall())

[('imdb_basics',), ('imdb_directors',), ('imdb_writers',), ('imdb_names',), ('imdb_principals',), ('imdb_ratings',), ('tmdb_movies',), ('tmdb_movie_genres',), ('tmdb_movie_companies',), ('tmdb_movie_countries',)]

# Initial Analysis Notes and thoughts:
The question I am asked to investigate is: "which movies are doing best at the box office?" But if the business goal is successfully entering the movie-making market, this question is only one of many we should ask and answer to determine the best approach.

Considering only the past earnings from box office sales is unlikely to be a good predictor of successful movies in the future. Even if we were to use only the past few years of data, the business model is rapidly changing. With the rise of streaming, many movies aren't released in theaters at all anymore, and the future of movie theaters has become especially uncertain due to the Covid-19 pandemic. 

The attributes of movies that are the most successful in the theaters may vary from the attributes of movies that are most successful when released only on streaming platforms. The reasons why people may choose to go and watch a movie in the theaters will be different from the reasons people choose to stream a movie: theaters offer an event-like experience with the very large screen and loud surround sound, whereas viewers streaming movies watch them in their homes. 

It's unclear whether the entire business model of creating movies for streaming services differs from the traditional model.

## Look deeper into what we have in each data set

Answer questions such as:
- What information is in each data set? Does any single data set have everything you need, or do you need to figure out how to join data sets?
- What is the range of release years in each data set? Which have the most data?
- What data points do I want to focus on in each data set, and what can I discard/disregard? This will narrow down the data I intend to clean up.

1. Monetary stuff in The Numbers data set - box office gross and budget. Look at changes over time to attempt to identify trends.
    - Is there a sweet spot in terms of a  budget range to maximize profit? Are there diminishing returns?
    - Do we see any trends in profits over time? Has the distribution of profits coming from domestic versus foreign changed over time?
2. What are the attributes of the most profitable movies? Do they get higher critical ratings? Is there a certain sweet spot for runtime length? How about MPAA ratings? Genres? Release month? <-- not sure we'll have MPAA ratings, but we'll have runtime, genres, and release date.
    - Should the studio focus on making movies that make critics happy to maximize profits? <-- not sure we'll be able to get this. but we can get public voter ratings.
3. What can we learn about the contributors to movies? If we look at the writers, directors, producers on the most profitable movies, then look at other movies they were in, do we see any patterns? How about the actors and actresses? Do more experienced contributors (those who have worked on x amount of movies prior) create a more profitable product?
    - Should Microsoft focus on hiring certain types of talent? Should they consider paying a premium for more famous actors or directors?

## Measures of successful movies include:

|Measure|Have it?|Where|Notes|
|---|---|---|---|
|Gross earnings (box office only)|Yes|bom.movie_gross.csv.gz, tn.movie_budgets.csv.gz, rt_movie_info|BOM splits into foreign and domestic. TN has the most records, AND prod budget. RT has only 1500.|
|Net box office earnings after subtracting costs|Some|Can calculate from gross - production budget|Other data sets have gross box office earnings but not production budget|df_tn_budget|
|Merchandising earnings|No|---|---|
|Gross earnings from other sources, such as streaming, rentals|No|---|
|High ratings from professional movie reviewers|Yes|rt.reviews.tsv.gz|RT is the only data set with critical reviews|
|High ratings from viewers|Yes|imdb.title.ratings.csv.gz, tmdb.movies.csv.gz|I think the tmdb ratings are users not critics|
|Being nominated for and winning awards|No|---|
|---|---|---|
 
Microsoft will need to decide which measures of success are most important. Given its primary business is profitable and in a totally different economic sector, it may decide to treat the foray into film as a way to keep the brand feeling "cool" to consumers. If that's the case, measures of success such as ratings and award nominations may be weighted more heavily than profit.

## What measures of success would a film STUDIO care about?

https://www.entrepreneur.com/article/288819 accessed march 15, 2021

"In short, the studio approach to filmmaking is a far cry from the ragtag process many independent films follow. Movie studios invest in scripts and concepts, then hire production companies to use their resources to create those films. They handle logistics like financing, production and distribution to make things easier on the creative minds behind the films."

In addition to profitability, **which production companies have been behind the most profitable films?**

The **specific writers and directors associated with profitable movies** may also be a factor studios would care about.

## Potential Independent Variables
Reasons why certain movies may be more successful than others (independent variables) include:

|Independent Variable|Have it?|Where|Notes|
|---|---|---|---|
|Budget - i.e. how much money they spent making it|Yes|tn.movie_budgets.csv.gz|
|Genre (action, drama, comedy, etc)|Yes|imdb.title.basics.csv.gz|
|Well-known and loved actors being in them|Yes, ish|imdb.name.basics.csv.gz, imdb.title.principals.csv.gz|Join tables to figure out who did what|
|Well-known and loved writers, directors, and other creators|Yes|imdb.name.basics.csv.gz,imdb.title.crew.csv.gz||
|Seasonality (combination of topic and release date)|No|---|
|Whether the movie is part of a series or franchise|Can get|---|Perhaps if based on a book or comic book? https://www.the-numbers.com/movies/franchises|
|Month of release|Yes|tmdb.movies.csv.gz|
|Method of release (in theaters only, straight to streaming, etc)|No|---|
|MPAA Rating|Yes|rt.movie_info.tsv.gz|
|Runtime length|Yes|rt.movie_info.tsv.gz, imdb.title.basics.csv.gz|
|Semantic characteristics of the title|Yes|imdb.title.akas.csv.gz|---|
|Semantic characteristics of the official synopsis|Yes|rt.movie_info.tsv.gz|---|

## Potential Trends to Consider
- Has there been any change in the popularity of movies directed by different categories of people? For instance, are movies written or directed by women becoming more popular over time?
- How is the method of release changing over time?
- Are budgets changing over time? Is the change in line with inflation, or changing at a higher rate?
- Is the general profitability changing over time? Should Microsoft rethink getting into movies if the profit margins are getting slimmer and slimmer?
- How many very successful movies are made by smaller, independent studios? How long have the most successful studios been established?
- Is there a really big gap between the highest earners / most popular and the average? Do the movies we consider successful stand way out from the pack? What's the standard deviation?

## Sources used for research
- In general, major studios don’t disclose the full budgets for their films (production, development, marketing, and advertising).[1]
- In addition to the cost of production, the gross box office earnings don't factor in that the theaters keep a cut of the ticket sales. It's hard to know what the production company actually gets.[1]
- "Traditionally, a larger chunk went to the studio during the opening weekend of a film. As the weeks went on, the theater operator's percentage rose. A studio might make about 60% of a film's ticket sales in the United States, and around 20% to 40% of that on overseas ticket sales." [1]
- "Studios and distributors generally make more from domestic revenue than from overseas sales because they get a larger percentage. Despite this arrangement, foreign ticket sales became more important in the early 21st century.6﻿ That is part of the reason why you see more sci-fi, adventure, fantasy, and superhero movies. Action and special effects require no translations. They’re easy to understand, whether you’re in Malaysia or Montana. It is much harder to build a foreign audience for an indie comedy." [1]
- The movie industry is rather famously difficult to predict accurately. Many have tried, but it's difficult to do. [2]
- One hit can pay for a lot of flops [2]
- Many of the existing production companies have been around for a long time [2]
-"Because it’s harder to get financing and audiences, companies are competing to make bigger, costlier films while eliminating risk, which is why ever-more movies are based on existing intellectual property. Eighteen of the all-time 100 top-grossing movies (adjusted for inflation) were sequels, and more than half of those were released since 2000." [2]


[1]: Source = https://www.investopedia.com/articles/investing/093015/how-exactly-do-movies-make-money.asp#:~:text=VOD%20revenues%20tend%20to%20dry,audiences%20away%20from%20traditional%20movies Accessed on 3/12/2021, 3/15/2021.

[2] Source = https://www.nytimes.com/2012/07/01/magazine/how-does-the-film-industry-actually-make-money.html Accessed 3/12/2021.